<?php
//2 тапсырма
$a = 5;
$b = 9;

// Айнымалылардың мәндерін ауыстыру
$x = $a;
$a = $b;
$b = $x;

echo "a = $a";
echo " b = $b";

//3 тапсырма
//$name = "Assan";
//$surname =" Zhapsar";
//echo$name . $surname;

//4 тапсырма

// Ұзындығы мен еніне мән беру
$a = 5;
$b = 10;

// Ауданын есептеу
$s = $a * $b;

//Нәтижені шығару
echo "Тік-төртбұрыштың ауданы: $s\n";

//5 тапсырма
// Консольдан ені мен ұзындығын енгізу
echo "Тік-төртбұрыштың енін енгізіңіз:";
$a = (float)readline();

echo "Тік-төртбұрыштың ұзындығын енгізіңіз: ";
$b = (float)readline();

// Ауданын есептеу
$s = $a * $b;
// Нәтижені шығару
echo "Тік-төртбұрыштың ауданы: $s\n";

//6 тапсырма
echo "Тікбұрыштың периметрі";
$a = (float)readline();
echo "Тікбұрыштың периметрі";
$b = (float)readline();

//Периметін табу
$perimeter  = 2*($a+$b);
echo"Тіктөртбұрыштың периметрі $perimeter\n";




